v1: 1958-2006 -> 2007-2017

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 28, 28, 32)        276512    
_________________________________________________________________
batch_normalization (BatchNo (None, 28, 28, 32)        128       
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
dense (Dense)                (None, 64)                1605696   
_________________________________________________________________
batch_normalization_1 (Batch (None, 64)                256       
_________________________________________________________________
dense_1 (Dense)              (None, 9600)              624000    
_________________________________________________________________
reshape (Reshape)            (None, 100, 12, 8)        0         
=================================================================
Total params: 2,506,592
Trainable params: 2,506,400
Non-trainable params: 192
_________________________________________________________________

v2: 1958-2006 -> 2007-2017

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 28, 28, 32)        276512    
_________________________________________________________________
batch_normalization (BatchNo (None, 28, 28, 32)        128       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 26, 26, 64)        18496     
_________________________________________________________________
batch_normalization_1 (Batch (None, 26, 26, 64)        256       
_________________________________________________________________
flatten (Flatten)            (None, 43264)             0         
_________________________________________________________________
dense (Dense)                (None, 256)               11075840  
_________________________________________________________________
batch_normalization_2 (Batch (None, 256)               1024      
_________________________________________________________________
dense_1 (Dense)              (None, 9600)              2467200   
_________________________________________________________________
reshape (Reshape)            (None, 100, 12, 8)        0         
=================================================================
Total params: 13,839,456
Trainable params: 13,838,752
Non-trainable params: 704
_________________________________________________________________

v3: same as v2 but 1958-1968 -> 1968-1978


